In [1]:
import pandas as pd
import numpy as np

In [2]:
#Read the data
credit_data = pd.read_csv('credit_scoring_eng.csv')
credit_data.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,-4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase
2,0,-5623.422610,33,Secondary Education,1,married,0,M,employee,0,23341.752,purchase of the house
3,3,-4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding

In [3]:
#Look at the data types and nulls of columns in the DataFrame
credit_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [4]:
#What is the shape of the DataFrame?
credit_data.shape

(21525, 12)

In [5]:
#I'll drop the 'days_employed' column since it will not provide any information in my analysis.
#credit_data.drop(['days_employed'], axis=1, inplace=True)

In [6]:
#Identify and fill in missing values
credit_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [7]:
#count number of nulls in every column
credit_data.isnull().sum()
#total_income has 2174 null values.

children               0
days_employed       2174
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income        2174
purpose                0
dtype: int64

In [8]:
#I assume that null values in the total_income and days_employed are not missing by random.*Check notes to explain further
#They are related, meaning no employment.
#I'll fill in the null values with 0 in the total_income and days_employed columns
credit_data.fillna(value=0, axis=1, inplace=True)
credit_data.isnull().sum()

children            0
days_employed       0
dob_years           0
education           0
education_id        0
family_status       0
family_status_id    0
gender              0
income_type         0
debt                0
total_income        0
purpose             0
dtype: int64

In [9]:
#Replace floats with integer data type
print(credit_data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     21525 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      21525 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB
None

In [10]:
#I'll relace the columns with type 'float64' to type 'int64' using np.int64
#days_employed to int
credit_data['days_employed'] = credit_data['days_employed'].astype(np.int64)

In [11]:
#total_income to int
credit_data['total_income'] = credit_data['total_income'].astype(np.int64)

In [12]:
#Lookin at duplicated rows in the data
print(credit_data.duplicated().sum())

54

In [13]:
#drop duplicate rows
#I use the keyword argument 'ignore_index', so that i dont have to reset the index
credit_data.drop_duplicates(inplace=True, ignore_index=True)

In [14]:
#the shape of my DataFrame has changed because of the duplicate rows that have been removed.
credit_data.shape

(21471, 12)

In [15]:
#the age column has 0 values. This could be due to during collection, the client did not give his/her age.
#I will set the 0 to the median of the age column
credit_data.loc[credit_data['dob_years'] == 0, 'dob_years'] = credit_data['dob_years'].median() 
credit_data['dob_years'].describe()

count    21471.000000
mean        43.476643
std         12.217612
min         19.000000
25%         33.500000
50%         42.000000
75%         53.000000
max         75.000000
Name: dob_years, dtype: float64

In [16]:
#change dob_years to int
credit_data['dob_years'] = credit_data['dob_years'].astype('int64')

In [17]:
#Categorize the data: education, family_status, gender, income_type, purpose
#education
credit_data['education'].value_counts()

secondary education    13705
bachelor's degree       4710
SECONDARY EDUCATION      772
Secondary Education      711
some college             668
BACHELOR'S DEGREE        273
Bachelor's Degree        268
primary education        250
Some College              47
SOME COLLEGE              29
PRIMARY EDUCATION         17
Primary Education         15
graduate degree            4
Graduate Degree            1
GRADUATE DEGREE            1
Name: education, dtype: int64

In [18]:
#there is a lot of repetition in the education column
#convert all the rows into lowercase
credit_data['education'] = credit_data['education'].str.lower()
credit_data['education'].unique()

array(["bachelor's degree", 'secondary education', 'some college',
       'primary education', 'graduate degree'], dtype=object)

In [19]:
credit_data['family_status'].value_counts()

married              12344
civil partnership     4163
unmarried             2810
divorced              1195
widow / widower        959
Name: family_status, dtype: int64

In [20]:
credit_data['gender'].value_counts()

F      14189
M       7281
XNA        1
Name: gender, dtype: int64

In [21]:
#I'll replace the XNA with the top gender in the data
credit_data.loc[credit_data['gender'] == 'XNA', 'gender'] = credit_data.gender.describe().top

In [22]:
credit_data['income_type'].value_counts()

employee                       11091
business                        5080
retiree                         3837
civil servant                   1457
unemployed                         2
entrepreneur                       2
paternity / maternity leave        1
student                            1
Name: income_type, dtype: int64

In [23]:
#I'll take it that the student is unemployed, 
#and the paternity leave is employed(at the time of data collection, he was on leave. But generally he is employed.)
#entrepreneur belongs to business 
#So, I'll change that.
credit_data.loc[credit_data['income_type'] == 'student', 'income_type'] = 'unemployed'
credit_data.loc[credit_data['income_type'] == 'paternity / maternity leave', 'income_type'] = 'employee'
credit_data.loc[credit_data['income_type'] == 'entrepreneur', 'income_type'] = 'business'

In [24]:
#purpose: use stemming to categorize the purpose column
from nltk.stem import SnowballStemmer
stemmer = SnowballStemmer('english')
words = ['wedding', 'estate', 'housing', 'house', 'property', 'car', 'education', 'university', 'educated']
stem = []
for word in words:
    stem.append(stemmer.stem(word))
print(stem)

['wed', 'estat', 'hous', 'hous', 'properti', 'car', 'educ', 'univers', 'educ']

In [25]:
def purpose_category(purpose):
    stemmed = [stemmer.stem(word) for word in purpose.split(' ')]
    if 'wed' in stemmed:
        return 'wedding'
    if 'estat' in stemmed:
        return 'real estate'
    if 'hous' in stemmed:
        return 'real estate'
    if 'properti' in stemmed:
        return 'real estate'
    if 'car' in stemmed:
        return 'car'
    if 'educ' in stemmed:
        return 'education'
    if 'univers' in stemmed:
        return 'education'
    else:
        return 'unknown'

In [26]:
credit_data['purpose_category'] = credit_data['purpose'].apply(purpose_category)

In [27]:
credit_data.columns

Index(['children', 'days_employed', 'dob_years', 'education', 'education_id',
       'family_status', 'family_status_id', 'gender', 'income_type', 'debt',
       'total_income', 'purpose', 'purpose_category'],
      dtype='object')

In [28]:
credit_data['education'] = credit_data.education.astype('category')
credit_data['family_status'] = credit_data.family_status.astype('category')
credit_data['gender'] = credit_data.gender.astype('category')
credit_data['income_type'] = credit_data.income_type.astype('category')
credit_data['purpose_category'] = credit_data.purpose_category.astype('category')

In [29]:
#clean the children column
credit_data['children'].describe()

count    21471.000000
mean         0.539565
std          1.382978
min         -1.000000
25%          0.000000
50%          0.000000
75%          1.000000
max         20.000000
Name: children, dtype: float64

In [30]:
#I'll ground the -1 children to 0, because it is an error that was made during input
credit_data.loc[credit_data['children'] == -1, 'children'] = 1
credit_data.loc[credit_data['children'] == 20, 'children'] = 2
credit_data['children'].value_counts()

0    14107
1     4856
2     2128
3      330
4       41
5        9
Name: children, dtype: int64

In [31]:
def child_group(children):
    if children == 0:
        return 'None'
    if 1 <= children <= 2:
        return 'Many'
    if 3 <= children <= 4:
        return 'Many More'
    else:
        return 'Most'
print(child_group(2))

Many

In [32]:
credit_data['child_group'] = credit_data['children'].apply(child_group)

In [33]:
credit_data.sample(2)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,purpose_category,child_group
10312,1,-1798,40,secondary education,1,married,0,F,employee,0,25865,buy real estate,real estate,Many
20856,0,396900,63,secondary education,1,widow / widower,2,F,retiree,0,17549,buy real estate,real estate,None

In [34]:
credit_data['debt'].value_counts()

0    19730
1     1741
Name: debt, dtype: int64

In [35]:
def debt_group(debt):
    if debt == 0:
        return 'paid'
    else:
        return 'defaulted'

In [36]:
credit_data['debt_group'] = credit_data['debt'].apply(debt_group)

In [37]:
credit_data['debt_group'] = credit_data['debt_group'].astype('category')
credit_data['child_group'] = credit_data['child_group'].astype('category')

In [38]:
credit_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21471 entries, 0 to 21470
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21471 non-null  int64
 1   days_employed     21471 non-null  int64
 2   dob_years         21471 non-null  int64
 3   education         21471 non-null  category
 4   education_id      21471 non-null  int64
 5   family_status     21471 non-null  category
 6   family_status_id  21471 non-null  int64
 7   gender            21471 non-null  category
 8   income_type       21471 non-null  category
 9   debt              21471 non-null  int64
 10  total_income      21471 non-null  int64
 11  purpose           21471 non-null  object
 12  purpose_category  21471 non-null  category
 13  child_group       21471 non-null  category
 14  debt_group        21471 non-null  category
dtypes: category(7), int64(7), object(1)
memory usage: 1.5+ MB

In [39]:
#create dictionaries
#which dictionaries you've selected for this data set and why.
#maybe create a dictionary and use pivot tables

In [40]:
#Task 3
#Answer the questions.

In [41]:
#Is there a connection between having kids and repaying a loan on time?
credit_by_children = credit_data.groupby('child_group')['debt_group']
#there's no correlation between having kids and paying loans on time, 
#because the most paid loans are for clients without children.
print(credit_by_children.count())
print(credit_by_children.value_counts())

child_group
Many          6984
Many More      371
Most             9
None         14107
Name: debt_group, dtype: int64
child_group  debt_group
Many         paid           6337
             defaulted       647
Many More    paid            340
             defaulted        31
Most         paid              9
None         paid          13044
             defaulted      1063
Name: debt_group, dtype: int64

In [42]:
print('Many children loans paid: {:.2%}'.format(6291/6937))
print('Many more children loans paid: {:.2%}'.format(340/371))
print('Most children loans paid: {:.2%}'.format(9/9))
print('None children loans paid: {:.2%}'.format(13090/14154))

Many children loans paid: 90.69%
Many more children loans paid: 91.64%
Most children loans paid: 100.00%
None children loans paid: 92.48%

In [43]:
#Is there a connection between marital status and repaying a loan on time?
credit_by_family = credit_data.groupby('family_status')['debt_group']
#yes, there is. Married people pay their loans more than any other group
print(credit_by_family.count())
print(credit_by_family.value_counts())

family_status
civil partnership     4163
divorced              1195
married              12344
unmarried             2810
widow / widower        959
Name: debt_group, dtype: int64
family_status      debt_group
civil partnership  paid           3775
                   defaulted       388
divorced           paid           1110
                   defaulted        85
married            paid          11413
                   defaulted       931
unmarried          paid           2536
                   defaulted       274
widow / widower    paid            896
                   defaulted        63
Name: debt_group, dtype: int64

In [44]:
print('Civil partnership loans paid: {:.2%}'.format(3775/4163))
print('Divorced loans paid: {:.2%}'.format(1110/1195))
print('Married loans paid: {:.2%}'.format(11413/12344))
print('Unmarried loans paid: {:.2%}'.format(2536/2810))
print('Widow/widower loans paid: {:.2%}'.format(896/959))

Civil partnership loans paid: 90.68%
Divorced loans paid: 92.89%
Married loans paid: 92.46%
Unmarried loans paid: 90.25%
Widow/widower loans paid: 93.43%

In [45]:
#Is there a connection between income level and repaying a loan on time?
credit_by_income = credit_data.groupby('income_type')['debt_group']
print(credit_by_income.count())
print(credit_by_income.value_counts())

income_type
business          5082
civil servant     1457
employee         11092
retiree           3837
unemployed           3
Name: debt_group, dtype: int64
income_type    debt_group
business       paid           4706
               defaulted       376
civil servant  paid           1371
               defaulted        86
employee       paid          10030
               defaulted      1062
retiree        paid           3621
               defaulted       216
unemployed     paid              2
               defaulted         1
Name: debt_group, dtype: int64

In [46]:
print('Business loans paid: {:.2%}'.format(4706/5082))
print('Civil servant loans paid: {:.2%}'.format(1371/1457))
print('Employee loans paid: {:.2%}'.format(10030/11092))
print('Retiree loans paid: {:.2%}'.format(3621/3837))
print('Unemployed loans paid: {:.2%}'.format(2/3))

Business loans paid: 92.60%
Civil servant loans paid: 94.10%
Employee loans paid: 90.43%
Retiree loans paid: 94.37%
Unemployed loans paid: 66.67%

In [47]:
#employees pay their loans on time, followed by business people

In [48]:
#How do different loan purposes affect timely loan repayment?
credit_by_purpose = credit_data.groupby('purpose_category')['debt_group']
print(credit_by_purpose.count())

purpose_category
car             4308
education       4014
real estate    10814
wedding         2335
Name: debt_group, dtype: int64

In [49]:
print(credit_by_purpose.value_counts())

purpose_category  debt_group
car               paid           3905
                  defaulted       403
education         paid           3644
                  defaulted       370
real estate       paid          10032
                  defaulted       782
wedding           paid           2149
                  defaulted       186
Name: debt_group, dtype: int64

In [50]:
print('Car loans paid: {:.2%}'.format(3905/4308))
print('Education loans paid: {:.2%}'.format(3644/4014))
print('Real Estate loans paid: {:.2%}'.format(10032/10814))
print('Wedding loans paid: {:.2%}'.format(2149/2335))

Car loans paid: 90.65%
Education loans paid: 90.78%
Real Estate loans paid: 92.77%
Wedding loans paid: 92.03%

In [55]:
purpose_dict = credit_data[['purpose_category', 'debt_group']]

0          paid
1          paid
2          paid
3          paid
4          paid
5          paid
6          paid
7          paid
8          paid
9          paid
12         paid
13         paid
18         paid
19         paid
21         paid
23         paid
26         paid
32    defaulted
38    defaulted
39         paid
Name: debt_group, dtype: category
Categories (2, object): [defaulted, paid]